# EditTexture

## Description
Function EditTexture opens the Edit Texture dialog for the referenced texture.

```pascal
FUNCTION EditTexture(texture : HANDLE): BOOLEAN;
```

```python
def vs.EditTexture(texture):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|texture|HANDLE|Handle to texture.|

## Remarks
Brings up the Edit Texture dialog for this texture

## Version
Availability: from VectorWorks8.0

## Category
* Textures